import 'package:kakao_map_sdk/kakao_map_sdk.dart';

class MapConstants {
  static const int defaultZoomLevel = 14;
  static const LatLng defaultPosition = LatLng(37.5665, 126.9780);
  static const double searchRadius = 5.0;
}

class RegionConstants {
  RegionConstants._();

  static const List<String> regions = [
    '서울특별시',
    '경기도',
    '인천광역시',
    '부산광역시',
    '대구광역시',
    '광주광역시',
    '대전광역시',
    '울산광역시',
    '세종특별자치시',
    '강원특별자치도',
    '경상북도',
    '경상남도',
    '전라북도',
    '전라남도',
    '충청북도',
    '충청남도',
    '제주특별자치도',
  ];

  static const Map<String, List<String>> regionDetails = {
    '서울특별시': [
      '종로구',
      '중구',
      '용산구',
      '성동구',
      '광진구',
      '동대문구',
      '중랑구',
      '성북구',
      '강북구',
      '도봉구',
      '노원구',
      '은평구',
      '서대문구',
      '마포구',
      '양천구',
      '강서구',
      '구로구',
      '금천구',
      '영등포구',
      '동작구',
      '관악구',
      '서초구',
      '강남구',
      '송파구',
      '강동구',
    ],

    '경기도': [
      '수원시',
      '성남시',
      '용인시',
      '고양시',
      '부천시',
      '안산시',
      '안양시',
      '평택시',
      '화성시',
      '남양주시',
    ],

    '인천광역시': [
      '중구',
      '동구',
      '미추홀구',
      '연수구',
      '남동구',
      '부평구',
      '서구',
    ],

    '부산광역시': [
      '중구',
      '서구',
      '동구',
      '영도구',
      '부산진구',
      '동래구',
      '남구',
      '북구',
      '해운대구',
      '사하구',
      '금정구',
      '연제구',
      '수영구',
      '사상구',
    ],

    '대구광역시': [
      '중구',
      '동구',
      '서구',
      '남구',
      '북구',
      '수성구',
      '달서구',
      '달성군',
    ],

    '광주광역시': [
      '동구',
      '서구',
      '남구',
      '북구',
      '광산구',
    ],

    '대전광역시': [
      '동구',
      '중구',
      '서구',
      '유성구',
      '대덕구',
    ],

    '울산광역시': [
      '중구',
      '남구',
      '동구',
      '북구',
      '울주군',
    ],

    '세종특별자치시': [
      '세종특별자치시',
    ],

    '강원특별자치도': [
      '춘천시',
      '원주시',
      '강릉시',
      '속초시',
      '동해시',
      '태백시',
    ],

    '경상북도': [
      '포항시',
      '경주시',
      '구미시',
      '안동시',
      '김천시',
    ],

    '경상남도': [
      '창원시',
      '김해시',
      '진주시',
      '통영시',
      '사천시',
    ],

    '전라북도': [
      '전주시',
      '군산시',
      '익산시',
      '정읍시',
      '남원시',
    ],

    '전라남도': [
      '여수시',
      '순천시',
      '목포시',
      '광양시',
      '나주시',
    ],

    '충청북도': [
      '청주시',
      '충주시',
      '제천시',
    ],

    '충청남도': [
      '천안시',
      '아산시',
      '서산시',
      '당진시',
    ],

    '제주특별자치도': [
      '제주시',
      '서귀포시',
    ],
  };
}
