class RegionConstants {
  RegionConstants._();

  static const List<String> regions = [
    '서울',
    '경기',
    '인천',
    '부산',
    '강원',
    '경상',
    '전라',
    '충청',
  ];

  static const Map<String, List<String>> regionDetails = {
    '서울': [
      '종로',
      '중구',
      '용산',
      '성동',
      '광진',
      '동대문',
      '중랑',
      '성북',
      '강북',
      '도봉',
      '노원',
      '은평',
      '서대문',
      '마포',
      '양천',
      '강서',
      '구로',
      '금천',
      '영등포',
      '동작',
      '관악',
      '서초',
      '강남',
      '송파',
      '강동',
    ],
    '경기': ['수원', '성남', '용인', '고양'],
    '인천': ['중구', '남동구', '연수구'],
    '부산': ['해운대', '수영', '부산진'],
    '강원': ['강릉', '춘천'],
    '경상': ['대구', '포항'],
    '전라': ['전주', '광주'],
    '충청': ['대전', '청주'],
  };
}
